<script setup lang="ts">
import { ref, inject } from 'vue'
import { useRouter, useRoute } from 'vue-router'
const isAuthModal = ref(false)
const router = useRouter()
type AuthState = {
	isAuthUser: Ref<boolean>
}
const auth = inject<AuthState>('auth')
function openAuthModal() {
	if (auth?.isAuthUser.value === true) {
		router.push('/profile')
		return
	}
	isAuthModal.value = true
}
const route = useRoute()
const props = defineProps({
	label: String,
	path: String,
})
const isDeliveryActive = computed(() => route.path === '/delivery')
const isOrdersActive = computed(() => route.path === '/orders')
const isBasketActive = computed(() => route.path === '/basket')
const isProfileActive = computed(() => route.path === '/profile')
</script>
<template>
	<header
		class="relative bg-gradient-to-r from-lime-400 via-lime-500 to-lime-600 h-16 shadow-lg flex items-center justify-center"
	>
		<div
			class="w-[1400px] m-auto flex flex-row items-center justify-between"
		>
			<NuxtLink to="/" class="w-fit">
				<svg
					width="75"
					height="24"
					viewBox="0 0 75 24"
					fill="none"
					xmlns="http://www.w3.org/2000/svg"
				>
					<path
						d="M14.432 1.6H17.792L9.024 10.496L18.272 24H15.52L7.392 12.192L3.488 16.288V24H0.928V1.6H3.488V12.96L14.432 1.6ZM21.6835 0.0639992H26.4835L29.0755 1.6V19.872L30.2915 21.696H35.8595L35.8275 24H29.0755L26.4835 20.192V2.368H21.6835V0.0639992ZM43.271 6.304H53.319L55.335 9.28V24H52.647V22.368L49.959 24H43.271L40.583 20V18.72L45.575 13.536H52.647V8.672H43.271V6.304ZM43.271 19.68L44.519 21.568H52.647V15.968H46.631L43.271 19.424V19.68ZM60.0905 7.008H62.6505V8.544L65.2425 7.008H71.6745L74.2665 10.784V24H71.6745V11.104L70.4585 9.312H63.6425L62.6505 10.336V24H60.0905V7.008Z"
						fill="black"
					/>
				</svg>
			</NuxtLink>

			<ul
				class="flex w-fit justify-between items-center gap-5 text-white"
			>
				<NuxtLink
					:class="['header-item', { active: isDeliveryActive }]"
					to="/delivery"
					class="flex items-center gap-3"
				>
					<div class="svg-container">
						<svg
							width="23"
							height="18"
							viewBox="0 0 23 18"
							fill="none"
							xmlns="http://www.w3.org/2000/svg"
						>
							<path
								d="M1.725 0C0.772656 0 0 0.755859 0 1.6875V12.9375C0 13.8691 0.772656 14.625 1.725 14.625H2.3C2.3 16.4883 3.84531 18 5.75 18C7.65469 18 9.2 16.4883 9.2 14.625H13.8C13.8 16.4883 15.3453 18 17.25 18C19.1547 18 20.7 16.4883 20.7 14.625H21.85C22.4861 14.625 23 14.1223 23 13.5C23 12.8777 22.4861 12.375 21.85 12.375V10.125V9V8.34258C21.85 7.74492 21.6092 7.17188 21.178 6.75L18.4 4.03242C17.9688 3.61055 17.383 3.375 16.772 3.375H14.95V1.6875C14.95 0.755859 14.1773 0 13.225 0H1.725ZM14.95 5.625H16.772L19.55 8.34258V9H14.95V5.625ZM7.475 14.625C7.475 15.5566 6.70234 16.3125 5.75 16.3125C4.79766 16.3125 4.025 15.5566 4.025 14.625C4.025 13.6934 4.79766 12.9375 5.75 12.9375C6.70234 12.9375 7.475 13.6934 7.475 14.625ZM17.25 16.3125C16.2977 16.3125 15.525 15.5566 15.525 14.625C15.525 13.6934 16.2977 12.9375 17.25 12.9375C18.2023 12.9375 18.975 13.6934 18.975 14.625C18.975 15.5566 18.2023 16.3125 17.25 16.3125Z"
								fill="#949494"
							/>
						</svg>
					</div>
					<h2>Доставка</h2>
				</NuxtLink>

				<NuxtLink
					:class="['header-item', { active: isOrdersActive }]"
					to="/orders"
					class="flex items-center gap-3"
				>
					<div class="svg-container">
						<svg
							width="21"
							height="21"
							viewBox="0 0 21 21"
							fill="none"
							xmlns="http://www.w3.org/2000/svg"
						>
							<path
								d="M2.37656 1.24219L0 6H9.75V0H4.39219C3.53906 0 2.76094 0.482812 2.37656 1.24219ZM11.25 6H21L18.6234 1.24219C18.2391 0.482812 17.4609 0 16.6078 0H11.25V6ZM21 7.5H0V18C0 19.6547 1.34531 21 3 21H18C19.6547 21 21 19.6547 21 18V7.5Z"
								fill="#949494"
							/>
						</svg>
					</div>
					<h2>Заказы</h2>
				</NuxtLink>
				<NuxtLink
					:class="['header-item', { active: isBasketActive }]"
					to="/basket"
					class="flex items-center gap-3"
				>
					<div class="svg-container">
						<svg
							width="25"
							height="19"
							viewBox="0 0 25 19"
							fill="none"
							xmlns="http://www.w3.org/2000/svg"
						>
							<path
								d="M24.4792 6.78572H21.315L15.7242 0.358679C15.3517 -0.0696265 14.6943 -0.121707 14.2559 0.242347C13.8176 0.6064 13.7643 1.24879 14.1369 1.6771L18.5808 6.78572H6.41923L10.8632 1.67706C11.2357 1.24875 11.1824 0.606357 10.7441 0.242304C10.3058 -0.121749 9.64835 -0.0696265 9.27578 0.358637L3.68494 6.78572H0.520833C0.233203 6.78572 0 7.01359 0 7.29465V8.31251C0 8.59356 0.233203 8.82143 0.520833 8.82143H1.33103L2.52825 17.2443C2.67127 18.2508 3.55191 19 4.59175 19H20.4082C21.4481 19 22.3287 18.2508 22.4718 17.2443L23.669 8.82143H24.4792C24.7668 8.82143 25 8.59356 25 8.31251V7.29465C25 7.01359 24.7668 6.78572 24.4792 6.78572ZM20.4082 16.9643H4.59175L3.43433 8.82143H21.5656L20.4082 16.9643ZM13.5417 11.1964V14.5893C13.5417 15.1514 13.0753 15.6071 12.5 15.6071C11.9247 15.6071 11.4583 15.1514 11.4583 14.5893V11.1964C11.4583 10.6343 11.9247 10.1786 12.5 10.1786C13.0753 10.1786 13.5417 10.6343 13.5417 11.1964ZM18.4028 11.1964V14.5893C18.4028 15.1514 17.9364 15.6071 17.3611 15.6071C16.7858 15.6071 16.3194 15.1514 16.3194 14.5893V11.1964C16.3194 10.6343 16.7858 10.1786 17.3611 10.1786C17.9364 10.1786 18.4028 10.6343 18.4028 11.1964ZM8.68056 11.1964V14.5893C8.68056 15.1514 8.21419 15.6071 7.63889 15.6071C7.06358 15.6071 6.59722 15.1514 6.59722 14.5893V11.1964C6.59722 10.6343 7.06358 10.1786 7.63889 10.1786C8.21419 10.1786 8.68056 10.6343 8.68056 11.1964Z"
								fill="#949494"
							/>
						</svg>
					</div>
					<h2>Корзина</h2>
				</NuxtLink>

				<NuxtLink
					:class="['header-item', { active: isProfileActive }]"
					:to="auth?.isAuthUser.value ? '/profile' : ''"
					class="flex items-center gap-3"
				>
					<div class="svg-container">
						<svg
							width="25"
							height="25"
							viewBox="0 0 25 25"
							fill="none"
							xmlns="http://www.w3.org/2000/svg"
						>
							<path
								d="M12.5 0C5.59476 0 0 5.59476 0 12.5C0 19.4052 5.59476 25 12.5 25C19.4052 25 25 19.4052 25 12.5C25 5.59476 19.4052 0 12.5 0ZM18.9516 21.25C17.1421 22.5857 14.9143 23.3871 12.5 23.3871C10.0857 23.3871 7.85786 22.5857 6.04839 21.25V20.5645C6.04839 18.7853 7.49496 17.3387 9.27419 17.3387C9.83367 17.3387 10.6603 17.9133 12.5 17.9133C14.3448 17.9133 15.1613 17.3387 15.7258 17.3387C17.505 17.3387 18.9516 18.7853 18.9516 20.5645V21.25ZM20.494 19.8639C20.1512 17.5252 18.1603 15.7258 15.7258 15.7258C14.6925 15.7258 14.1935 16.3004 12.5 16.3004C10.8065 16.3004 10.3125 15.7258 9.27419 15.7258C6.83972 15.7258 4.84879 17.5252 4.50605 19.8639C2.71673 17.9234 1.6129 15.3427 1.6129 12.5C1.6129 6.49698 6.49698 1.6129 12.5 1.6129C18.503 1.6129 23.3871 6.49698 23.3871 12.5C23.3871 15.3427 22.2833 17.9234 20.494 19.8639ZM12.5 5.64516C10.0504 5.64516 8.06452 7.63105 8.06452 10.0806C8.06452 12.5302 10.0504 14.5161 12.5 14.5161C14.9496 14.5161 16.9355 12.5302 16.9355 10.0806C16.9355 7.63105 14.9496 5.64516 12.5 5.64516ZM12.5 12.9032C10.9425 12.9032 9.67742 11.6381 9.67742 10.0806C9.67742 8.52319 10.9425 7.25806 12.5 7.25806C14.0575 7.25806 15.3226 8.52319 15.3226 10.0806C15.3226 11.6381 14.0575 12.9032 12.5 12.9032Z"
								fill="#949494"
							/>
						</svg>
					</div>
					<h2 v-if="auth?.isAuthUser.value">Профиль</h2>
					<h2 v-else @click="isAuthModal = true">Войти</h2>
				</NuxtLink>
			</ul>
		</div>
	</header>
	<AuthModal :is-open="isAuthModal" @close="isAuthModal = false"></AuthModal>
</template>
<style></style>
